{
  "metadata": {
    "subsystem": "limbs_lower",
    "description": "Lower limb reflex loops coordinating stance, locomotion, and protective withdrawal during ambulation.",
    "schema_version": "1.0",
    "notes": "Qualitative reflex registry entries; numeric biomimetic gains intentionally omitted."
  },
  "reflex_arcs": {
    "patellar_stretch": {
      "stimulus": "Quadriceps muscle spindle activation following patellar tendon tap or rapid knee flexion.",
      "afferent": "Femoral nerve Ia afferents → L2-L4 dorsal horn.",
      "integration": "Monosynaptic excitation of quadriceps alpha motor neurons with reciprocal inhibition of hamstrings.",
      "efferent": "Femoral nerve motor outflow.",
      "effector": "Knee extension restoring limb support.",
      "response_type": "somatic",
      "notes": "Stabilizes knee during stance and reactive stepping."
    },
    "plantar": {
      "stimulus": "Cutaneous stimulation of the plantar surface during gait or nociceptive contact.",
      "afferent": "Tibial nerve afferents → lumbosacral interneurons.",
      "integration": "S1-L5 polysynaptic network directing toe flexors and ankle stabilizers.",
      "efferent": "Tibial and peroneal motor branches.",
      "effector": "Toe flexion with ankle inversion to protect the sole.",
      "response_type": "protective",
      "notes": "Supports weight shift away from hazards."
    },
    "crossed_extensor": {
      "stimulus": "Activation of ipsilateral flexor withdrawal pathways.",
      "afferent": "Commissural interneurons distributing the signal across lumbar segments.",
      "integration": "Pattern formation network augmenting contralateral extensors during stepping.",
      "efferent": "Femoral, gluteal, and gastrocnemius motor outflow.",
      "effector": "Extension of the opposite limb to maintain balance and propulsion.",
      "response_type": "coordinated",
      "notes": "Critical for alternating gait and balance recovery."
    },
    "gait_central_pattern": {
      "stimulus": "Descending locomotor command or sensory phase resetting cues.",
      "afferent": "Proprioceptive feedback from hip and ankle receptors.",
      "integration": "Lumbosacral central pattern generators cycling flexor/extensor synergy.",
      "efferent": "Segmental motor neuron pools driving rhythmic activation of hip, knee, and ankle musculature.",
      "effector": "Alternating flexion-extension sequence that underlies stepping cadence.",
      "response_type": "rhythmic",
      "notes": "Synchronizes with vestibulospinal inputs for smooth locomotion."
    }
  }
}