{
  "metadata": {
    "subsystem": "postural_balance",
    "description": "Balance and equilibrium reflexes aligning the body against gravity and during locomotion.",
    "schema_version": "1.0",
    "notes": "Dedicated posture reflex registry separate from biomimetic balance controllers."
  },
  "reflex_arcs": {
    "tonic_neck": {
      "stimulus": "Proprioceptive shift from cervical rotation or flexion.",
      "afferent": "Muscle spindles and joint receptors in upper cervical spine.",
      "integration": "Vestibulospinal and propriospinal circuits adjusting limb tone.",
      "efferent": "Alpha motor neurons to limb extensors and flexors.",
      "effector": "Redistribution of limb tone favoring extension on the face side and flexion contralaterally.",
      "response_type": "postural"
    },
    "righting": {
      "stimulus": "Combined vestibular and visual cues indicating body tilt.",
      "afferent": "Otolith organs and retinal slip detectors to vestibular nuclei.",
      "integration": "Vestibulospinal tracts coordinating axial musculature.",
      "efferent": "Spinal motor outputs to neck, trunk, and limb muscles.",
      "effector": "Sequential adjustments bringing head and body back to vertical alignment.",
      "response_type": "equilibrium"
    },
    "equilibrium": {
      "stimulus": "Center-of-mass displacement during standing or walking.",
      "afferent": "Proprioceptive feedback from ankles, knees, hips, and vestibular apparatus.",
      "integration": "Cerebellar-vestibular-spinal network computing corrective torques.",
      "efferent": "Descending tracts to antigravity muscles.",
      "effector": "Coordinated ankle, hip, and stepping strategies to maintain base of support.",
      "response_type": "adaptive"
    },
    "locomotor_cpgs": {
      "stimulus": "Initiation of gait or perturbations requiring phase reset.",
      "afferent": "Phase-dependent proprioceptive cues from limbs and vestibular input.",
      "integration": "Spinal central pattern generators modulated by supraspinal centers.",
      "efferent": "Segmental motor pools controlling rhythmic flexor/extensor bursts.",
      "effector": "Stable stepping rhythm synchronized with balance responses.",
      "response_type": "rhythmic"
    },
    "antigravity_tone": {
      "stimulus": "Gravitational loading sensed by proprioceptors and vestibular otoliths.",
      "afferent": "Muscle spindles, Golgi organs, and vestibular afferents.",
      "integration": "Reticulospinal and vestibulospinal pathways maintaining extensor bias.",
      "efferent": "Gamma and alpha motor neuron activity in axial and proximal limb muscles.",
      "effector": "Sustained extensor tone preventing collapse during stance.",
      "response_type": "tonic"
    }
  }
}